src/cf/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияЗагрузкиИндексовСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СостоянияЗагрузкиИндексовСПАРКРиски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапущеноФоновоеЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаФоновогоЗадания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФоновогоЗадания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОшибокСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОшибокСПАРКРиски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяОшибкаСервиса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнтернетПоддержкаНеПодключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеЗапрещено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеОтключено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеизвестнаяОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеизвестныйИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректныйЗапрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекорректныйИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодлежитПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаАутентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПодключения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПревышеноКоличествоПопытокАутентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплатаИлиПревышенЛимит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияВыводаИндексовСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СостоянияВыводаИндексовСПАРКРиски</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКэшеНетДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКэшеУстаревшиеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеправильныйИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзКэша</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФоновогоЗадания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/СПАРКРискиКлиентСерверДокументооборот/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтобразитьИндексыСПАРКДокументаСОднимКонтрагентом(РезультатИндексыКонтрагента, КонтрагентОбъект, Контрагент,
	Форма, ИспользованиеРазрешено, Параметры, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользованиеРазрешено Тогда
		
		Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Ложь;
		Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭтоНеФизлицо = Ложь;
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЮрФизЛицо = ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(Контрагент, "ЮрФизЛицо");
		Если ЮрФизЛицо <> ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо") Тогда
			ЭтоНеФизлицо = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	Если РезультатИндексыКонтрагента.ПодлежитПроверке <> Истина 
		Или Не ЗначениеЗаполнено(РезультатИндексыКонтрагента.Контрагент)
		Или ЭтоНеФизлицо Тогда
		// НЕ юридических лиц (физлиц, иностранные организации и т.п.) - не выводим вообще.
		Форма.Элементы.ДекорацияИндексыСПАРКРиски.Видимость                 = Ложь;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Ложь;
		
		Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Ложь;
		Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Ложь;
		Возврат;
	Иначе
		Форма.Элементы.ДекорацияИндексыСПАРКРиски.Видимость                 = Истина;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Истина;
	КонецЕсли;

	// В форме имена элементов управления и реквизита - фиксированные.
	// 1. В зависимости от того, загружены данные, или выполнятся фоновое задание, вывести или скрыть картинку ожидания.
	Если РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ЗапущеноФоновоеЗадание") Тогда
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Истина;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Подсказка = НСтр("ru='Выполняется получение данных из Интернет.'");
	ИначеЕсли РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОтменаФоновогоЗадания") Тогда
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Истина;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Картинка = БиблиотекаКартинок.Предупреждение;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Подсказка = НСтр("ru='Получение данных из Интернет отменено.'");
	ИначеЕсли РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОшибкаФоновогоЗадания") Тогда
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Истина;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Картинка = БиблиотекаКартинок.Предупреждение;
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Подсказка = НСтр("ru='Ошибка получения данных из Интернет.'");
	Иначе // Загрузка завершена или не осуществлялась.
		Форма.Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Ложь;
	КонецЕсли;
	
	ЦветаСтилей = СПАРКРискиВызовСервера.ЦветаСтилей();

	МассивСтрок = Новый Массив;
	
	Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаЗел.Видимость  = Ложь;
	Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаОранж.Видимость  = Ложь;
	Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаКр.Видимость  = Ложь;
	
	// Если сервис не подключен, то выводится:
	// "1СПАРК Риски: оценка надежности контрагентов. _Подробнее_".
	// Если данные есть, то:
	// "Индекс должной осмотрительности: %1 (_%2 риск_)".
	// В случае других ошибок, вывести их.
	ЕстьОшибкаПодключения = Истина;
	СводныйИндикаторКартинка = 0;
	Если РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ВнутренняяОшибкаСервиса") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ИнтернетПоддержкаНеПодключена") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ИспользованиеЗапрещено") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеизвестнаяОшибка") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеизвестныйИНН") Тогда
		ЕстьОшибкаПодключения = Ложь;
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
			НСтр("ru='Нет информации о контрагенте'"),
			,
			,
			,
			"SPARK:NoInformation"));
		СводныйИндикаторКартинка = 5;
		
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НекорректныйЗапрос") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НекорректныйИНН") Тогда
		ЕстьОшибкаПодключения = Ложь;
		МассивСтрок.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru='Нет информации о контрагенте'"),
				,
				ЦветаСтилей.ЦветОсобогоТекста,
				,
				"SPARK:NoInformation"));
		СводныйИндикаторКартинка = 5;
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеПодлежитПроверке") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ОшибкаПодключения") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ПревышеноКоличествоПопытокАутентификации") Тогда
	ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ТребуетсяОплатаИлиПревышенЛимит") Тогда
	Иначе // Пустое поле - ошибок нет.
		ЕстьОшибкаПодключения = Ложь;
		ЕстьОшибкаПолученияДанных = Ложь;

		ТекстОшибки = "";
		ЦветТекстаОшибки = ЦветаСтилей.ЦветОсобогоТекста;
		Если РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ВКэшеНетДанных") Тогда
			ЕстьОшибкаПолученияДанных = Истина;
			Если РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ЗапущеноФоновоеЗадание") Тогда
				ТекстОшибки = НСтр("ru='Получение данных...'");
				ЦветТекстаОшибки = Неопределено; // Авто
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОтменаФоновогоЗадания") Тогда
				ТекстОшибки = НСтр("ru='Ошибка получения данных (слишком медленное соединение или отменено администратором)'");
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОшибкаФоновогоЗадания") Тогда
				ТекстОшибки = НСтр("ru='Ошибка получения данных'");
			Иначе // Загрузка завершена или не осуществлялась.
				ТекстОшибки = НСтр("ru='Ошибка получения данных (данные не получены)'");
			КонецЕсли;
		ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ВКэшеУстаревшиеДанные") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.НеправильныйИНН") Тогда
			ЕстьОшибкаПолученияДанных = Истина;
			ТекстОшибки = Новый ФорматированнаяСтрока(
				НСтр("ru='Нет информации о контрагенте'"),
				,
				,
				,
				"SPARK:NoInformation");
			СводныйИндикаторКартинка = 5;
		ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПолученоИзКэша") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПолученоИзФоновогоЗадания") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПустаяСсылка") Тогда
		Иначе
			ЕстьОшибкаПолученияДанных = Истина;
			ТекстОшибки = НСтр("ru='Неопределенная ошибка'");
		КонецЕсли;
		Если ЕстьОшибкаПолученияДанных = Истина Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ТекстОшибки, , ЦветТекстаОшибки));
		Иначе
			
			// Если контрагент не активен, вывести сообщение "Контрагент прекратил деятельность %ДатаСтатуса%".
			Если (РезультатИндексыКонтрагента.Активен <> Истина) Тогда
				МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru='Контрагент прекратил деятельность %1'"),
							Формат(РезультатИндексыКонтрагента.ДатаСтатуса, "ДЛФ=D")),
						,
						ЦветаСтилей.ЦветОсобогоТекста));
				МассивСтрок.Добавить(Символы.ПС);
			Иначе
				// Есть статус не равен "Действующая" необходимо вывести его.
				Если (РезультатИндексыКонтрагента.СводныйИндикатор >= 0)
						И (РезультатИндексыКонтрагента.СводныйИндикатор <= 100) Тогда
						
					Если РезультатИндексыКонтрагента.СводныйИндикатор = 1 Тогда 
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаЗел.Видимость  = Истина;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаОранж.Видимость  = Ложь;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаКр.Видимость  = Ложь;
						Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Ложь;
						Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Истина;
						СводныйИндикаторКартинка = 3;
						
					ИначеЕсли РезультатИндексыКонтрагента.СводныйИндикатор = 2 Тогда 
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаЗел.Видимость  = Ложь;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаОранж.Видимость  = Истина;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаКр.Видимость  = Ложь;
						Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Ложь;
						Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Истина;
						СводныйИндикаторКартинка = 8;
						
					ИначеЕсли РезультатИндексыКонтрагента.СводныйИндикатор = 3 Тогда 
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаЗел.Видимость  = Ложь;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаОранж.Видимость  = Ложь;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаКр.Видимость  = Истина;
						Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Ложь;
						Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Истина;
						СводныйИндикаторКартинка = 1;
					Иначе 
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаЗел.Видимость  = Ложь;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаОранж.Видимость  = Ложь;
						Форма.Элементы.ДекорацияИндексыСПАРКРискиСтрока2КартинкаКр.Видимость  = Ложь;
						Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Ложь;
						СводныйИндикаторКартинка = 0;
					КонецЕсли
				Иначе
					МассивСтрок.Добавить(
						Новый ФорматированнаяСтрока(
							НСтр("ru='Нет информации о контрагенте'"),
							,
							,
							,
							"SPARK:NoInformation"));
					СводныйИндикаторКартинка = 5;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьОшибкаПодключения = Истина Тогда
		Если РезультатИндексыКонтрагента.ДоступностьПодключенияТестовогоПериода = "Доступно" Тогда
			МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='1СПАРК Риски:'")
						+ " "));
			МассивСтрок.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Подключить'"),
					,
					,
					,
					"SPARK:ConnectTrialTariff"));
			МассивСтрок.Добавить(" ");
			МассивСтрок.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='тестовый период или'")));
			МассивСтрок.Добавить(" ");
			МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='купить сервис'"),
						,
						,
						,
						"SPARK:BuyTariff"));
			МассивСтрок.Добавить(" ");
			МассивСтрок.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='проверки и мониторинга контрагентов'")
					+ " "));
				
		ИначеЕсли РезультатИндексыКонтрагента.ДоступностьПодключенияТестовогоПериода = "Подключение" Тогда
			МассивСтрок.Добавить(
				НСтр("ru = 'Выполняется подключение.'"));
		Иначе
		Если Не РезультатИндексыКонтрагента.ДанныеАутентификацииЗаполнены Тогда
				
				МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='1СПАРК Риски:'")
						+ " "));
				
				МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='Подробнее'"),
						,
						,
						,
						"SPARK:About"));
				
				МассивСтрок.Добавить(" ");
				МассивСтрок.Добавить(
					НСтр("ru='о проверке и мониторинге контрагентов'"));
				
			Иначе
				
				МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='1СПАРК Риски:'")
						+ " "));
				
				МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='Купить сервис'"),
						,
						,
						,
						"SPARK:BuyService"));
				
				МассивСтрок.Добавить(" ");
				МассивСтрок.Добавить(
					Новый ФорматированнаяСтрока(
						НСтр("ru='проверки и мониторинга контрагентов'")
						+ " "));
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Справочник.ВнутренниеДокументы.Форма.ФормаЭлемента"
		И Форма.Объект.Контрагенты.Количество() > 0 Тогда 
		Форма.Объект.Контрагенты[0].СводныйИндикатор = СводныйИндикаторКартинка;
		Форма.Объект.Контрагенты[0].ИндексыСПАРКРиски = РезультатИндексыКонтрагента;
	ИначеЕсли Форма.ИмяФормы = "Справочник.ИсходящиеДокументы.Форма.ФормаЭлемента"
		И Форма.Объект.Получатели.Количество() > 0 Тогда 
		Форма.Объект.Получатели[0].СводныйИндикатор = СводныйИндикаторКартинка;
		Форма.Объект.Получатели[0].ИндексыСПАРКРиски = РезультатИндексыКонтрагента;
	КонецЕсли;
	
	Результат = Новый ФорматированнаяСтрока(МассивСтрок);
	Форма.Элементы.ДекорацияИндексыСПАРКРиски.Заголовок = Результат;
	Если ЗначениеЗаполнено(Результат) Тогда 
		Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтобразитьИндексыСПАРКДокументаСНесколькимиКонтрагентами(ИндексыКонтрагентов, Форма, ИспользованиеРазрешено, Параметры, СтандартнаяОбработка,
	Контрагенты, ИмяКолонки = "Контрагент") Экспорт
	
	Если Не ИспользованиеРазрешено Тогда
		
		Форма.Элементы.ГруппаИндексыСПАРКРиски.Видимость = Ложь;
		Форма.Элементы.ГруппаИндексыСПАРКРиски2.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЦветаСтилей = СПАРКРискиВызовСервера.ЦветаСтилей();
	
	МассивИндексовКонтрагентов = Новый Массив;
	Если ТипЗнч(ИндексыКонтрагентов) = Тип("Структура") Тогда 
		МассивИндексовКонтрагентов.Добавить(ИндексыКонтрагентов);
	ИначеЕсли ТипЗнч(ИндексыКонтрагентов) = Тип("СписокЗначений") Тогда 
		МассивИндексовКонтрагентов = ИндексыКонтрагентов.ВыгрузитьЗначения();
	КонецЕсли;
	
	Для Каждого РезультатИндексыКонтрагента Из МассивИндексовКонтрагентов Цикл 
		//РезультатИндексыКонтрагента = ИндексыКонтрагента.Значение;
		
		Если РезультатИндексыКонтрагента.ПодлежитПроверке <> Истина Тогда
			Продолжить;
		КонецЕсли;

		ЦветСтиляЦветОсобогоТекста = ЦветаСтилей.ЦветОсобогоТекста;
		МассивСтрок = Новый Массив;
		СводныйИндикатор = 0; ИнформацияСпаркРиски = "";
		// Если сервис не подключен, то выводится:
		// "1СПАРК Риски: оценка надежности контрагентов. _Подробнее_".
		// Если данные есть, то:
		// "Индекс должной осмотрительности: %1 (_%2 риск_)".
		// В случае других ошибок, вывести их.
		Если РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ВнутренняяОшибкаСервиса") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ИнтернетПоддержкаНеПодключена") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ИспользованиеЗапрещено") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеизвестнаяОшибка") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеизвестныйИНН") Тогда
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
				НСтр("ru='Нет информации о контрагенте'"),
				,
				,
				,
				"SPARK:NoInformation"));
			ИнформацияСпаркРиски = "SPARK:NoInformation";
			СводныйИндикатор = 5;
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НекорректныйЗапрос") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НекорректныйИНН") Тогда
			МассивСтрок.Добавить(
				Новый ФорматированнаяСтрока(
					НСтр("ru='Нет информации о контрагенте'"),
					,
					ЦветСтиляЦветОсобогоТекста,
					,
					"SPARK:NoInformation"));
				ИнформацияСпаркРиски = "SPARK:NoInformation";
				СводныйИндикатор = 5;
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеПодлежитПроверке") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ОшибкаПодключения") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ПревышеноКоличествоПопытокАутентификации") Тогда
		ИначеЕсли РезультатИндексыКонтрагента.ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.ТребуетсяОплатаИлиПревышенЛимит") Тогда
		Иначе // Пустое поле - ошибок нет.
			ЕстьОшибкаПолученияДанных = Ложь;

			ТекстОшибки = "";
			ЦветТекстаОшибки = ЦветСтиляЦветОсобогоТекста;
			Если РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ВКэшеНетДанных") Тогда
				ЕстьОшибкаПолученияДанных = Истина;
				Если РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ЗапущеноФоновоеЗадание") Тогда
					ТекстОшибки = НСтр("ru='Получение данных...'");
					ЦветТекстаОшибки = Неопределено; // Авто
				ИначеЕсли РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОтменаФоновогоЗадания") Тогда
					ТекстОшибки = НСтр("ru='Ошибка получения данных (слишком медленное соединение или отменено администратором)'");
				ИначеЕсли РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОшибкаФоновогоЗадания") Тогда
					ТекстОшибки = НСтр("ru='Ошибка получения данных'");
				Иначе // Загрузка завершена или не осуществлялась.
					ТекстОшибки = НСтр("ru='Ошибка получения данных (данные не получены)'");
				КонецЕсли;
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ВКэшеУстаревшиеДанные") Тогда
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.НеправильныйИНН") Тогда
				ЕстьОшибкаПолученияДанных = Истина;
				ТекстОшибки = Новый ФорматированнаяСтрока(
					НСтр("ru='Нет информации о контрагенте'"),
					,
					,
					,
					"SPARK:NoInformation");
				ИнформацияСпаркРиски = "SPARK:NoInformation";
				СводныйИндикатор = 5;
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПолученоИзКэша") Тогда
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПолученоИзФоновогоЗадания") Тогда
			ИначеЕсли РезультатИндексыКонтрагента.СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПустаяСсылка") Тогда
			Иначе
				ЕстьОшибкаПолученияДанных = Истина;
				ТекстОшибки = НСтр("ru='Неопределенная ошибка'");
			КонецЕсли;
			Если ЕстьОшибкаПолученияДанных = Истина Тогда
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(ТекстОшибки, , ЦветТекстаОшибки));
			Иначе
				
				// Если контрагент не активен, вывести сообщение "Контрагент прекратил деятельность %ДатаСтатуса%".
				Если (РезультатИндексыКонтрагента.Активен <> Истина) Тогда
					МассивСтрок.Добавить(
						Новый ФорматированнаяСтрока(
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru='Контрагент прекратил деятельность %1'"),
								Формат(РезультатИндексыКонтрагента.ДатаСтатуса, "ДЛФ=D")),
							,
							ЦветСтиляЦветОсобогоТекста));
					МассивСтрок.Добавить(Символы.ПС);
					СводныйИндикатор = 1;
					ИнформацияСпаркРиски = "SPARK:NoInformation";
					
				Иначе
					// Есть статус не равен "Действующая" необходимо вывести его.
					Если (РезультатИндексыКонтрагента.СводныйИндикатор >= 0)
						И (РезультатИндексыКонтрагента.СводныйИндикатор <= 3) Тогда
						Если РезультатИндексыКонтрагента.СводныйИндикатор = 1 Тогда 
							СводныйИндикатор = 3;
							ИнформацияСпаркРиски = РезультатИндексыКонтрагента.СводныйИндикаторАдресКомандыПодсказки;
							
						ИначеЕсли РезультатИндексыКонтрагента.СводныйИндикатор = 2 Тогда 
							СводныйИндикатор = 8;
							ИнформацияСпаркРиски = РезультатИндексыКонтрагента.СводныйИндикаторАдресКомандыПодсказки;
							
						ИначеЕсли РезультатИндексыКонтрагента.СводныйИндикатор = 3 Тогда 
							СводныйИндикатор = 1;
							ИнформацияСпаркРиски = РезультатИндексыКонтрагента.СводныйИндикаторАдресКомандыПодсказки;
							
						КонецЕсли
					Иначе
						МассивСтрок.Добавить(
							Новый ФорматированнаяСтрока(
								НСтр("ru='Нет информации о контрагенте'"),
								,
								,
								,
								"SPARK:NoInformation"));
								
						СводныйИндикатор = 5;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаКонтрагент Из Контрагенты Цикл 
			Если СтрокаКонтрагент[ИмяКолонки] = РезультатИндексыКонтрагента.Контрагент Тогда 
				СтрокаКонтрагент.СводныйИндикатор = СводныйИндикатор;
				СтрокаКонтрагент.ИнформацияСпаркРиски = ИнформацияСпаркРиски;
				СтрокаКонтрагент.ИндексыСПАРКРиски = РезультатИндексыКонтрагента;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
